# GetOwnerViewId Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElementRecord..::..GetOwnerViewId Method
ElementRecord Class See Also
---
Gets the element id of the owner view record.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public ElementId GetOwnerViewId()
```

Visual Basic
---
```text
Public Function GetOwnerViewId As ElementId
```

Visual C++
---
```text
public:
ElementId^ GetOwnerViewId()
```

# ### Return Value
The view record element id.
# See Also
ElementRecord Class
Autodesk.Revit.DB Namespace